In [1]:
import sqlite3
import pandas as pd
from pyprojroot import here

In [2]:
# Connect to SQLite database
db_path = here('data/Chinook.db')
conn = sqlite3.connect(db_path)

In [3]:
# Get list of all tables
query = "SELECT name FROM sqlite_master WHERE type='table';"
tables = pd.read_sql(query, conn)
tables

             name
0           Album
1          Artist
2        Customer
3        Employee
4           Genre
5         Invoice
6     InvoiceLine
7       MediaType
8        Playlist
9   PlaylistTrack
10          Track

In [5]:
query = """SELECT Album.Title
FROM Album
JOIN Artist ON Album.ArtistId = Artist.ArtistId
WHERE Artist.Name = 'Alanis Morissette';"""
tables = pd.read_sql(query, conn)
tables

                Title
0  Jagged Little Pill